{"A.8_RESEARCH_STRATEGY_MAP":{"schema_version":"G3_2.2.2","description":"Targeted research plan with mandatory coverage and dynamic allocation.","Uncertainty_Nexus_Analysis":{"Lynchpins":[{"ID":"L1","Driver_Handle":"Revenue_Growth_Y1_Y5","Tornado_Rank":1,"IVPS_Swing_Percent":17.0,"Uncertainty_Justification":"Revenue CAGR Y1-Y5 p10-p90 range of 10%-40% reflects high uncertainty in MTM growth trajectory and ARPU expansion from new products (BNPL). Market saturation timing and competitive response are unknowable."},{"ID":"L2","Driver_Handle":"Net_Monetization_Rate","Tornado_Rank":2,"IVPS_Swing_Percent":12.5,"Uncertainty_Justification":"Net monetization rate (4.8%) depends on CashAI effectiveness and competitive pricing dynamics. 86% revenue concentration in ExtraCash magnifies sensitivity. Regulatory changes could force fee structure modifications."},{"ID":"L3","Driver_Handle":"EBIT_Margin_Terminal","Tornado_Rank":3,"IVPS_Swing_Percent":9.8,"Uncertainty_Justification":"Terminal EBIT margin range of 15%-30% (p10-p90) reflects uncertainty about long-term competitive intensity in neobanking and operating leverage sustainability."}]},"Research_Plan":[{"RQ_ID":"RQ1","Allocation_Type":"MANDATORY","Coverage_Objective":"M-1 Integrity Check","Platform":"GDR","Platform_Rationale":"GDR can synthesize across SEC filings, proxy statements, short-seller reports, and financial news to identify forensic accounting and governance concerns.","A7_Linkage":"A.1 Investment Thesis - Management Assessment; A.6 X adjustment for management_governance (-0.15)","Prompt_Text":"Research accounting and governance concerns for Dave Inc. (NYSE: DAVE), a fintech neobank company. I need to understand:\n\n(1) Any auditor concerns, qualified opinions, or emphasis-of-matter items in Dave's 10-K filings from 2022-2025\n(2) Any significant changes to revenue recognition policies, particularly for ExtraCash processing fees and tip income\n(3) Related party transactions or conflicts of interest involving management, especially founder/CEO Jason Wilk and CFO Kyle Beilman\n(4) Insider selling activity by executives and directors over the past 24 months - quantities, timing relative to earnings, and any 10b5-1 plan modifications\n(5) Current short interest levels, short interest ratio trends over the past 12 months, and whether any activist short-sellers have published reports on Dave\n(6) Any SEC comment letters or inquiries related to Dave's financial reporting\n\nFocus on the period 2022-2025. Cite specific SEC filings, proxy statements, and news sources."},{"RQ_ID":"RQ2","Allocation_Type":"MANDATORY","Coverage_Objective":"M-2 Adversarial Synthesis","Platform":"GDR","Platform_Rationale":"GDR excels at synthesizing diverse viewpoints across analyst reports, financial news, earnings call commentary, and investor debates.","A7_Linkage":"A.1 Investment Thesis - Key Risks (Regulatory, Competition, Credit); A.6 X adjustment for regulatory_environment (+0.4)","Prompt_Text":"What are the strongest bull and bear arguments for Dave Inc. (NYSE: DAVE) stock?\n\n(1) Identify the top 3 concerns raised by skeptics, short-sellers, or bearish analysts about Dave. What specific evidence do they cite? Focus on:\n   - Regulatory risks (DOJ lawsuit, CFPB, state-level actions)\n   - Business model sustainability (ExtraCash as disguised lending)\n   - Credit quality concerns (rising delinquencies)\n   - Competitive threats from Chime, Cash App, or traditional banks\n\n(2) Identify the top 3 arguments made by bulls or optimistic analysts about Dave. What evidence supports their view? Focus on:\n   - Unit economics (CAC, LTV, payback period)\n   - Growth trajectory (MTM acceleration, ARPU expansion)\n   - Management execution track record\n   - Competitive moat from CashAI underwriting\n\n(3) List any active lawsuits, regulatory investigations, or material legal disputes involving Dave. Include case numbers, filing dates, and current status.\n\n(4) What are the key debates among analysts regarding Dave's valuation? What price targets and ratings have been issued in the past 6 months?\n\nI want the actual arguments being made in the market, not your own analysis. Cite analyst reports, news articles, and SEC filings."},{"RQ_ID":"RQ3","Allocation_Type":"MANDATORY","Coverage_Objective":"M-3 Scenario H.A.D.","Platform":"GDR","Platform_Rationale":"GDR can retrieve historical precedents across multiple companies and regulatory actions to provide base rates and magnitude data for scenario parameterization.","A7_Linkage":"A.1 Investment Thesis - Regulatory Risk (DOJ lawsuit, CFPB); A.7 Model Notes - Not Modeled Quantitatively items","Prompt_Text":"I'm researching historical precedents for potential scenarios affecting Dave Inc. (NYSE: DAVE) in the fintech neobanking industry:\n\n**MAINLINE SCENARIOS:**\n\n- Scenario A: DOJ/CFPB Enforcement Action - Find 3-5 comparable situations where the DOJ or CFPB took enforcement action against fintech lenders or earned wage access providers (2018-2025). For each case:\n  - Company name and nature of violation alleged\n  - Settlement amount or penalty imposed\n  - Stock price impact in the 30 days after announcement and resolution\n  - Required business model changes or operational restrictions\n  - Timeline from investigation announcement to resolution\n\n- Scenario B: Bank Partner Transition - Find 3-5 examples of fintech companies that switched their bank partner (similar to Dave's transition from Evolve Bank to Coastal Community Bank). For each:\n  - What triggered the transition?\n  - How long did the transition take?\n  - Was there any customer disruption or revenue impact?\n  - What was the stock price impact during transition period?\n\n**TAIL RISKS:**\n\n- Downside: Regulatory Prohibition - Find 2-3 examples where regulators effectively prohibited or severely restricted a fintech product category (payday lending alternatives, earned wage access, etc.). What was the peak-to-trough stock impact and timeline?\n\n- Upside: Acquisition by Major Bank - Find 2-3 examples of major banks acquiring fintech neobanks or consumer lending platforms (2020-2025). What acquisition multiples (EV/Revenue, EV/User) were paid? What premium to pre-announcement stock price?\n\nI need specific historical data points with dates, dollar amounts, and percentages - not general commentary."},{"RQ_ID":"RQ4","Allocation_Type":"DYNAMIC","Coverage_Objective":"L1 - Revenue Growth Uncertainty","Platform":"GDR","Platform_Rationale":"GDR can synthesize industry reports, competitor disclosures, and analyst research to provide comparative data on neobank growth trajectories and market sizing.","A7_Linkage":"Lynchpin L1 - Revenue_Growth_Y1_Y5 (17.0% IVPS swing); A.1 TAM assumptions (185M underbanked Americans, 1.8% penetration)","Prompt_Text":"Research the growth trajectory and market opportunity for Dave Inc. (NYSE: DAVE) and its neobank competitors:\n\n(1) Compare Monthly Transacting Member (MTM) or Monthly Active User (MAU) growth rates for these companies over the past 8 quarters (2024-2025):\n   - Dave Inc.\n   - Chime (private - any available data from funding rounds or reports)\n   - Cash App consumer segment (Block/Square disclosures)\n   - Current (if available)\n   - MoneyLion\n   - SoFi Banking segment\n\n(2) What is the total addressable market (TAM) for earned wage access and neobanking services targeting underbanked Americans? Retrieve estimates from:\n   - Financial Health Network reports\n   - Industry analyst estimates\n   - Company investor presentations\n\n(3) What market share estimates exist for Dave vs. competitors in the earned wage access / cash advance category?\n\n(4) What has Dave management stated about MTM growth targets, member reactivation potential (they cite 11M dormant members), and market saturation timeline in recent earnings calls (Q2-Q3 2025)?\n\n(5) What are third-party forecasts for the U.S. neobank market CAGR through 2030?\n\nPrioritize recent data (2024-2025) and cite specific sources including investor presentations, earnings call transcripts, and industry reports."},{"RQ_ID":"RQ5","Allocation_Type":"DYNAMIC","Coverage_Objective":"L2 - Net Monetization Rate and Credit Performance","Platform":"GDR","Platform_Rationale":"GDR can retrieve competitor unit economics from earnings disclosures, industry benchmarks, and analyst coverage to assess Dave's monetization sustainability.","A7_Linkage":"Lynchpin L2 - Net_Monetization_Rate (12.5% IVPS swing); A.2 Y0_data ChargeOff_Rate_121Day (1.46%), Delinquency_Rate_28Day (2.33%)","Prompt_Text":"Research the unit economics and credit performance for Dave Inc. (NYSE: DAVE) compared to fintech peers:\n\n(1) Compare these metrics across earned wage access and cash advance providers:\n   - Take rate / fee structure (processing fees, tips, instant transfer fees)\n   - Loss rates / charge-off rates\n   - Customer acquisition cost (CAC)\n   - Average revenue per user (ARPU)\n   - Companies: Dave, Earnin, Brigit, MoneyLion, Chime SpotMe\n\n(2) What is the historical trend of Dave's key credit metrics over the past 8 quarters:\n   - 28-day delinquency rate\n   - 121-day charge-off rate\n   - Provision for credit losses as % of originations\n   - How do these compare to Q3 2025 levels (2.33% 28DPD, 1.46% charge-off)?\n\n(3) What has Dave management stated about the intentional trade-off between loss rates and gross profit optimization in recent earnings calls? Quote specific commentary.\n\n(4) What is the industry view on earned wage access credit risk - do industry reports or regulators classify these products as lending or payment services? Retrieve any CFPB, OCC, or state regulator guidance.\n\n(5) How did credit performance for fintech lenders change during the 2022-2023 rate hiking cycle? Retrieve loss rate trends for comparable companies.\n\nCite earnings releases, investor presentations, regulatory filings, and industry reports."},{"RQ_ID":"RQ6","Allocation_Type":"DYNAMIC","Coverage_Objective":"L3 - Competitive Dynamics and Margin Sustainability","Platform":"GDR","Platform_Rationale":"GDR can synthesize competitive intelligence from multiple sources to assess Dave's margin sustainability against well-capitalized competitors.","A7_Linkage":"Lynchpin L3 - EBIT_Margin_Terminal (9.8% IVPS swing); A.1 Investment Thesis - Competitive Position; A.6 X adjustment for competitive_position (+0.05)","Prompt_Text":"Research the competitive dynamics and margin structure in the U.S. neobank and earned wage access market:\n\n(1) Compare operating margin / EBITDA margin across these companies (most recent quarter and trailing 12 months):\n   - Dave Inc.\n   - SoFi Technologies (banking segment)\n   - Block/Cash App (consumer segment)\n   - MoneyLion\n   - LendingClub\n   - Traditional bank digital offerings (if margin data available)\n\n(2) What pricing changes have competitors made in earned wage access / cash advance products over the past 24 months? Are fees increasing, decreasing, or stable? Retrieve specific examples of:\n   - Chime SpotMe limit increases or fee changes\n   - Cash App Borrow terms\n   - Any new entrant pricing strategies\n\n(3) What is Dave's customer acquisition cost ($19) relative to competitors? Retrieve CAC estimates for:\n   - Chime (reportedly $100+)\n   - Cash App\n   - SoFi\n   - Traditional banks' digital customer acquisition\n\n(4) What barriers to entry or switching costs exist in this market? Retrieve any analyst commentary on:\n   - Data moats from underwriting algorithms\n   - Bank partnership requirements\n   - Regulatory licensing requirements by state\n\n(5) What has Dave management stated about their competitive positioning and pricing power durability in recent earnings calls and investor presentations?\n\nCite earnings transcripts, analyst reports, investor presentations, and industry analyses."}],"Platform_Summary":{"GDR_Count":6,"Execution_Mode":"parallel","Expected_Duration_Seconds":"120-300"}}}
